import { Container, Typography } from "@mui/material";
import { useTranslation } from "react-i18next";
import styled from "styled-components";
import HomeLayout from "../../../components/HomeLayout/HomeLayout";
import { Heading } from "../../../components/UI/Heading/Heading";

const AboutWrapper = styled.section`
    margin: 100px 0;
    @media screen and (max-width: 899.98px) {
        margin: 70px 0;
    }
`

const AboutUs = props => {

    const { t } = useTranslation();


    return (
        <HomeLayout>
            <AboutWrapper>
                <Container maxWidth="lg">
                    <Heading>
                        <h2 style={{ textAlign: 'center' }} className="heading-title" >{t('who are we')}</h2>
                    </Heading>
                    <Typography variant="h5" component="div">
                        بدأت بيوتي بوينت في عام 2020 في المملكة العربية السعودية، لابتكار تجربة مختلفة. بيوتي بوينت موقع وتطبيق انطلق بموقع خاص ومميز، بالتزامن مع التطور العظيم الذي حدث في المملكة العربية السعودية، وقد ضم مجموعات مختارة بعناية من الصالونات الفاخرة في جميع أنحاء السعودية بهدف تغطية جميع متطلبات المرأة السعودية العصرية، وليس هذا فقط، فقد رغبت بيوتي بوينت في إسعاد المرأة السعودية بشكل كبير وذلك من خلال توفير تطبيق يجمع تلك الصالونات تحت مظله واحده يضم كل ما تحتاج إليه من خدمات تجميل وعنايه وطبي ، ومنتجات من مستحضرات تجميل ومنتجات عناية بالبشرة إضافة إلى العطور والمواد الغذائية الصحية، عالية الجودة. تعمل بيوتي بوينت على توفير الراحة والرفاهية وذلك من خلال فريق عمل يبحث عن كل ما هو جديد ومبتكر في عالم الجمال، ويعمل على إرشادك إلى ما يناسبك لتتمتعي بجمال وأناقة لا مثيل لها، وقد تم بناء هذا الكيان بناءً على مجموعة من القيم الهامة . التعاون بين فريق العمل للحصول على أفضل نتيجة، البساطة التي تمنحك جمال لا يقاوم، وقد تم وضع هذه الأسس لتتناسب مع أهداف السعودية الجديدة، وتمنح المرأة العصرية كل ما تبحث عنه. الجمال والاناقة هنا في بيوتي بوينت إيمانا منا بفكرة تمكين المرأة، قررنا مساندة الطموحات الحالمات في إثبات خطواتهن بكل ثقة وثبات على أرض الواقع، وذلك من خلال تخصيص مكان خاص ل المستقلات . مفهومنا يدور حول الابتكار والتطوير والمستمر لما هو جديد دائما . أقوى الصالونات ومراكز التجميل : بيوتي قررت أن تقدم مجتمع شامل بقيم جديدة، وبالتالي لابد أن تنقل لكِ كل ما هو جديد في عالم التجميل، حيث تقدم تشكيلة كبيرة من الصونات والمراكز التجميل ومنتجات العنايه والتجميل .. لتبقي دائما على اطلاع باحدث العروض والخدمات
                    </Typography>
                </Container>
            </AboutWrapper>
        </HomeLayout>
    )
}
export default AboutUs;